# В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, причем кусты высажены только по окружности.
# Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод – на i-ом кусте выросло ai ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль,
# находясь перед некоторым кустом заданной во входном файле грядки.

n = int(input('Введите количество кустов на грядке: '))
my_list = list()
for i in range(n):
    a = int(input('Введите количество ягод на кусте: '))
    my_list.append(a)
new_list = list()
for i in range(len(my_list)-1):
    result = my_list[i-1]+my_list[i]+my_list[i+1]
    new_list.append(result)
res = my_list[-2]+my_list[-1]+my_list[0]
new_list.append(res)
print(f'Собрано ягод: {max(new_list)}')
