# Найдите сумму цифр трехзначного числа.
# Пример
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input('Enter n: '))
n1 = n//100
n2 = (n%100) // 10
n3 = n % 10
print(f'Вывод суммы цифр: {n1+n2+n3}')
